polybassa/WyLight/cc3200/example/tcp_socket/main.c
    // Remove all profiles
    lRetVal = sl_WlanProfileDel(0xFF);
    ASSERT_ON_ERROR(__LINE__, lRetVal);

    // If the device is not in station-mode, try putting it in staion-mode
    if (ROLE_STA != lMode)
    {
        if (ROLE_AP == lMode)
        {
            // If the device is in AP mode, we need to wait for this event
            // before doing anything
            while(!IS_IP_ACQUIRED(g_ulStatus))
            {
#ifndef SL_PLATFORM_MULTI_THREADED
              _SlNonOsMainLoopTask();
#endif
            }
        }

        // Switch to STA role and restart
        lRetVal = sl_WlanSetMode(ROLE_STA);
        ASSERT_ON_ERROR(__LINE__, lRetVal);

        lRetVal = sl_Stop(SL_STOP_TIMEOUT);
        ASSERT_ON_ERROR(__LINE__, lRetVal);

        // reset status bits
        CLR_STATUS_BIT_ALL(g_ulStatus);

        lRetVal = sl_Start(0, 0, 0);
        ASSERT_ON_ERROR(__LINE__, lRetVal);

        // Check if the device is in station again
        if (ROLE_STA != lRetVal)
        {
            // We don't want to proceed if the device is not up in STA-mode
            return DEVICE_NOT_IN_STATION_MODE;
        }
    }

    //
    // Device in station-mode. Disconnect previous connection if any
    // The function returns 0 if 'Disconnected done', negative number if already
    // disconnected Wait for 'disconnection' event if 0 is returned, Ignore
    // other return-codes
    //
    lRetVal = sl_WlanDisconnect();
    if(0 == lRetVal)
    {
        // Wait
        while(IS_CONNECTED(g_ulStatus))
        {
#ifndef SL_PLATFORM_MULTI_THREADED
              _SlNonOsMainLoopTask();
#endif
        }
    }

    // Enable DHCP client
    lRetVal = sl_NetCfgSet(SL_IPV4_STA_P2P_CL_DHCP_ENABLE,1,1,&ucVal);
    ASSERT_ON_ERROR(__LINE__, lRetVal);

    // Disable scan
    ucConfigOpt = SL_SCAN_POLICY(0);
    lRetVal = sl_WlanPolicySet(SL_POLICY_SCAN , ucConfigOpt, NULL, 0);
    ASSERT_ON_ERROR(__LINE__, lRetVal);

    // Set Tx power level for station mode
    // Number between 0-15, as dB offset from max power - 0 will set max power
    ucPower = 0;
    lRetVal = sl_WlanSet(SL_WLAN_CFG_GENERAL_PARAM_ID,
            WLAN_GENERAL_PARAM_OPT_STA_TX_POWER, 1, (unsigned char *)&ucPower);
    ASSERT_ON_ERROR(__LINE__, lRetVal);

    // Set PM policy to normal
    lRetVal = sl_WlanPolicySet(SL_POLICY_PM , SL_NORMAL_POLICY, NULL, 0);
    ASSERT_ON_ERROR(__LINE__, lRetVal);

    // Unregister mDNS services
    lRetVal = sl_NetAppMDNSUnRegisterService(0, 0);
    ASSERT_ON_ERROR(__LINE__, lRetVal);

    lRetVal = sl_Stop(SL_STOP_TIMEOUT);
    ASSERT_ON_ERROR(__LINE__, lRetVal);

    InitializeAppVariables();

    return lRetVal; // Success
}


//****************************************************************************
//
//!    \brief Parse the input IP address from the user
//!
//!    \param[in]                     ucCMD (char pointer to input string)
//!
//!    \return                        0 : if correct IP, -1 : incorrect IP
//
//****************************************************************************
int IpAddressParser(char *ucCMD)
{
 int i=0;
    unsigned int uiUserInputData;
    unsigned long ulUserIpAddress = 0;
    char *ucInpString;
    ucInpString = strtok(ucCMD, ".");
    uiUserInputData = (int)strtoul(ucInpString,0,10);
    while(i<4)
    {
        //
       // Check Whether IP is valid
       //
       if((ucInpString != NULL) && (uiUserInputData < 256))
       {
           ulUserIpAddress |= uiUserInputData;
           if(i < 3)
               ulUserIpAddress = ulUserIpAddress << 8;
           ucInpString=strtok(NULL,".");
           uiUserInputData = (int)strtoul(ucInpString,0,10);
           i++;
       }
       else
       {
           return -1;
       }
    }
    g_ulDestinationIp = ulUserIpAddress;
    return 0;
}
//*****************************************************************************
//
//! UserInput
//!
//! This function
//!        1. Function for reading the user input for UDP RX/TX
//!
//! \return none
//
//*****************************************************************************
void UserInput()
{
    int iInput = 0;
    char acCmdStore[50];
    int iRetVal;
    int iRightInput = 0;
    unsigned long ulUserInputData = 0;

    UART_PRINT("Default settings: SSID Name: %s, PORT = %d, Packet Count = %d, "
                "Destination IP: %d.%d.%d.%d\n\r",
                    SSID_NAME, g_uiPortNum, g_ulPacketCount, 
                    SL_IPV4_BYTE(g_ulDestinationIp,3),
                    SL_IPV4_BYTE(g_ulDestinationIp,2),
                    SL_IPV4_BYTE(g_ulDestinationIp,1),
                    SL_IPV4_BYTE(g_ulDestinationIp,0));

    do
    {
        UART_PRINT("\r\nChoose Options:\r\n1. Send TCP packets.\r\n2. Receive "
                    "TCP packets.\r\n3. Settings.\r\n4. Exit\r\n");
        UART_PRINT("Enter the option to use: ");
        iRetVal = GetCmd(acCmdStore, sizeof(acCmdStore));
        if(iRetVal == 0)
        {
          //
          // No input. Just an enter pressed probably. Display a prompt.
          //
          UART_PRINT("\n\n\rEnter Valid Input.");
        }
        else
        {
            iInput  = (int)strtoul(acCmdStore,0,10);
          if(iInput  == 1)
          {
              UART_PRINT("Run iperf command \"iperf.exe -s -i 1\" and press "
                            "Enter\n\r");
                //
                // Wait to receive a character over UART
                //
                MAP_UARTCharGet(CONSOLE);
                UART_PRINT("Sending TCP packets...\n\r");

              // Before proceeding, please make sure to have a server waiting on
              // PORT_NUM
              BsdTcpClient(g_uiPortNum);
          }
          else if(iInput  == 2)
          {
              UART_PRINT("Run iperf command \"iperf.exe -c %d.%d.%d.%d -i 1 -t "
                            "100000\" and press Enter\n\r",
                            SL_IPV4_BYTE(g_ulIpAddr,3),
                            SL_IPV4_BYTE(g_ulIpAddr,2),
                            SL_IPV4_BYTE(g_ulIpAddr,1),
                            SL_IPV4_BYTE(g_ulIpAddr,0));
                //
                // Wait to receive a character over UART
                //
                MAP_UARTCharGet(CONSOLE);
                UART_PRINT("Receiving TCP packets...\n\r");
                // After calling this function, you can start sending data to 
                // CC3200 IP address on PORT_NUM
              BsdTcpServer(g_uiPortNum);
          }
          else if(iInput  == 3)
          {
              iRightInput = 0;
              do
                  {
                  //TODO write code to get inout for PORT/ IP/ Packet count
              UART_PRINT("\n\rSetting Options:\n\r1. PORT\n\r2. Packet Count\n\r"
                          "3. Destination IP\n\r4. Main Menu\r\n");
              UART_PRINT("Enter the option to use: ");
              iRetVal = GetCmd(acCmdStore, sizeof(acCmdStore));
              if(iRetVal == 0)
              {
                //
                // No input. Just an enter pressed probably. Display a prompt.
                //
                UART_PRINT("\n\n\rEnter Valid Input.");
              }
              else
              {

                      iInput  = (int)strtoul(acCmdStore,0,10);
                //SettingInput(iInput);
                switch(iInput)
                {
                    case 1:
                        do
                        {
                            UART_PRINT("Enter new Port: ");
                            iRetVal = GetCmd(acCmdStore, sizeof(acCmdStore));
                            if(iRetVal == 0)
                            {
                              //
                              // No input. Just an enter pressed probably. 
                              // Display a prompt.
                              //
                              UART_PRINT("\n\rEnter Valid Input.");
                              iRightInput = 0;
                            }
                            else
                            {
                                ulUserInputData = (int)strtoul(acCmdStore,0,10);
                              if(ulUserInputData <= 0 || ulUserInputData > 65535)
                              {
                                UART_PRINT("\n\rWrong Input");
                                iRightInput = 0;
                              }
                              else
                              {
                                  g_uiPortNum = ulUserInputData;
                                iRightInput = 1;
                              }
                            }

                            UART_PRINT("\r\n");
                        }while(!iRightInput);

                        iRightInput = 0;
                        break;
                    case 2:
                        do
                        {
                            UART_PRINT("Enter Packet Count: ");
                            iRetVal = GetCmd(acCmdStore, sizeof(acCmdStore));
                            if(iRetVal == 0)
                            {
                              //
                              // No input. Just an enter pressed probably. 
                              // Display a prompt.
                              //
                              UART_PRINT("\n\rEnter Valid Input.");
                              iRightInput = 0;
                            }
                            else
                            {
                                ulUserInputData = (int)strtoul(acCmdStore,0,10);
                              if(ulUserInputData <= 0 || ulUserInputData > 9999999)
                              {
                                UART_PRINT("\n\rWrong Input");
                                iRightInput = 0;
                              }
                              else
                              {
                                  g_ulPacketCount = ulUserInputData;
                                iRightInput = 1;
                              }
                            }

                            UART_PRINT("\r\n");
                        }while(!iRightInput);
                        iRightInput = 0;
                        break;
                    case 3:
                        do
                        {
                            UART_PRINT("Enter Destination IP: ");
                            iRetVal = GetCmd(acCmdStore, sizeof(acCmdStore));
                            if(iRetVal == 0)
                            {
                              //
                              // No input. Just an enter pressed probably. 
                              // Display a prompt.
                              //
                              UART_PRINT("\n\rEnter Valid Input.");
                              iRightInput = 0;
                            }
                            else
                            {
                            if(IpAddressParser(acCmdStore) < 0)
                              {
                                UART_PRINT("\n\rWrong Input");
                                iRightInput = 0;
                              }
                              else
                              {
                                iRightInput = 1;
                              }
                            }

                            UART_PRINT("\r\n");
                        }while(!iRightInput);
                        iRightInput = 0;
                        break;
                    case 4:
                        iRightInput = 1;
                        break;


