polybassa/WyLight/cc3200/example/tcp_socket/main.c
                }

              }
          }while(!iRightInput);

          }
          else if(iInput == 4)
          {
              break;
          }
          else
          {
            UART_PRINT("\n\n\rWrong Input");
          }
        }
        UART_PRINT("\n\r");
    }while(1);

    return ;

}


//****************************************************************************
//
//! \brief Opening a TCP client side socket and sending data
//!
//! This function opens a TCP socket and tries to connect to a Server IP_ADDR
//!    waiting on port PORT_NUM.
//!    If the socket connection is successful then the function will send 1000
//! TCP packets to the server.
//!
//! \param[in]      port number on which the server will be listening on
//!
//! \return    0 on success, -1 on Error.
//
//****************************************************************************
int BsdTcpClient(unsigned short usPort)
{
  int             iCounter;
  short           sTestBufLen;
  SlSockAddrIn_t  sAddr;
  int             iAddrSize;
  int             iSockID;
  int             iStatus;
  long            lLoopCount = 0;

  // filling the buffer
  for (iCounter=0 ; iCounter<BUF_SIZE ; iCounter++)
  {
    g_cBsdBuf[iCounter] = (char)(iCounter % 10);
  }

  sTestBufLen  = BUF_SIZE;

  //filling the TCP server socket address
  sAddr.sin_family = SL_AF_INET;
  sAddr.sin_port = sl_Htons((unsigned short)usPort);
  sAddr.sin_addr.s_addr = sl_Htonl((unsigned int)g_ulDestinationIp);

  iAddrSize = sizeof(SlSockAddrIn_t);

  // creating a TCP socket
  iSockID = sl_Socket(SL_AF_INET,SL_SOCK_STREAM, 0);
  if( iSockID < 0 )
  {
    // error
   return -1;
  }

  // connecting to TCP server
  iStatus = sl_Connect(iSockID, ( SlSockAddr_t *)&sAddr, iAddrSize);
  if( iStatus < 0 )
  {
    // error
    sl_Close(iSockID);
    return -1;
  }

  // sending multiple packets to the TCP server
  while (lLoopCount < g_ulPacketCount)
  {
    // sending packet
    iStatus = sl_Send(iSockID, g_cBsdBuf, sTestBufLen, 0 );
    if( iStatus <= 0 )
    {
        // error
        sl_Close(iSockID);
        return -1;
    }
    lLoopCount++;
  }

  Report("Sent %u packets successfully\n\r",g_ulPacketCount);

  //closing the socket after sending 1000 packets
  sl_Close(iSockID);

  return 0;
}

//****************************************************************************
//
//! \brief Opening a TCP server side socket and receiving data
//!
//! This function opens a TCP socket in Listen mode and waits for an incoming
//!    TCP connection.
//! If a socket connection is established then the function will try to read
//!    1000 TCP packets from the connected client.
//!
//! \param[in] port number on which the server will be listening on
//!
//! \return     0 on success, -1 on error.
//!
//! \note   This function will wait for an incoming connection till
//!                     one is established
//
//****************************************************************************
int BsdTcpServer(unsigned short usPort)
{
  SlSockAddrIn_t  sAddr;
  SlSockAddrIn_t  sLocalAddr;
  int             iCounter;
  int             iAddrSize;
  int             iSockID;
  int             iStatus;
  int             iNewSockID;
  long            lLoopCount = 0;
  long            lNonBlocking = 1;
  int             iTestBufLen;

  // filling the buffer
  for (iCounter=0 ; iCounter<BUF_SIZE ; iCounter++)
  {
    g_cBsdBuf[iCounter] = (char)(iCounter % 10);
  }

  iTestBufLen  = BUF_SIZE;

  //filling the TCP server socket address
  sLocalAddr.sin_family = SL_AF_INET;
  sLocalAddr.sin_port = sl_Htons((unsigned short)usPort);
  sLocalAddr.sin_addr.s_addr = 0;

  // creating a TCP socket
  iSockID = sl_Socket(SL_AF_INET,SL_SOCK_STREAM, 0);
  if( iSockID < 0 )
  {
    // error
    return -1;
  }

  iAddrSize = sizeof(SlSockAddrIn_t);

  // binding the TCP socket to the TCP server address
  iStatus = sl_Bind(iSockID, (SlSockAddr_t *)&sLocalAddr, iAddrSize);
  if( iStatus < 0 )
  {
    // error
    sl_Close(iSockID);
    return -1;
  }

  // putting the socket for listening to the incoming TCP connection
  iStatus = sl_Listen(iSockID, 0);
  if( iStatus < 0 )
  {
    sl_Close(iSockID);
    return -1;
  }

  // setting socket option to make the socket as non blocking
  iStatus = sl_SetSockOpt(iSockID, SL_SOL_SOCKET, SL_SO_NONBLOCKING, 
                            &lNonBlocking, sizeof(lNonBlocking));
  if( iStatus < 0 )
  {
    return -1;
  }
  iNewSockID = SL_EAGAIN;

  // waiting for an incoming TCP connection
  while( iNewSockID < 0 )
  {
    // accepts a connection form a TCP client, if there is any
    // otherwise returns SL_EAGAIN
    iNewSockID = sl_Accept(iSockID, ( struct SlSockAddr_t *)&sAddr, 
                            (SlSocklen_t*)&iAddrSize);
    if( iNewSockID == SL_EAGAIN )
    {
       MAP_UtilsDelay(10000);
    }
    else if( iNewSockID < 0 )
    {
      // error
      sl_Close(iNewSockID);
      sl_Close(iSockID);
      return -1;
    }
  }

  // waits for 1000 packets from the connected TCP client
  while (lLoopCount < g_ulPacketCount)
  {
    iStatus = sl_Recv(iNewSockID, g_cBsdBuf, iTestBufLen, 0);
    if( iStatus <= 0 )
    {
      // error
      sl_Close(iNewSockID);
      sl_Close(iSockID);
      return -1;
    }

    lLoopCount++;
  }


  Report("Recieved %u packets successfully\n\r",g_ulPacketCount);

  // close the connected socket after receiving from connected TCP client
  sl_Close(iNewSockID);

  // close the listening socket
  sl_Close(iSockID);

  return 0;
}

//****************************************************************************
//
//!  \brief Connecting to a WLAN Accesspoint
//!
//!   This function connects to the required AP (SSID_NAME) with Security
//!   parameters specified in te form of macros at the top of this file
//!
//!   \param[in]              None
//!
//!   \return     Status value
//!
//!   \warning    If the WLAN connection fails or we don't aquire an IP
//!            address, It will be stuck in this function forever.
//
//****************************************************************************
static long WlanConnect()
{
    SlSecParams_t secParams = {0};
    INT32 retVal = 0;

