polybassa/WyLight/cc3200/example/tcp_socket/main.c
    secParams.Key = SECURITY_KEY;
    secParams.KeyLen = strlen(SECURITY_KEY);
    secParams.Type = SECURITY_TYPE;

    retVal = sl_WlanConnect(SSID_NAME, strlen(SSID_NAME), 0, &secParams, 0);
    ASSERT_ON_ERROR(__LINE__, retVal);

    /* Wait */
    while((!IS_CONNECTED(g_ulStatus)) || (!IS_IP_ACQUIRED(g_ulStatus)))
    {
        // Wait for WLAN Event
#ifndef SL_PLATFORM_MULTI_THREADED
              _SlNonOsMainLoopTask();
#endif
    }

    return SUCCESS;

}

//*****************************************************************************
//
//! Application startup display on UART
//!
//! \param  none
//!
//! \return none
//!
//*****************************************************************************
static void
DisplayBanner(char * AppName)
{

    Report("\n\n\n\r");
    Report("\t\t *************************************************\n\r");
    Report("\t\t      CC3200 %s Application       \n\r", AppName);
    Report("\t\t *************************************************\n\r");
    Report("\n\n\n\r");
}

//*****************************************************************************
//
//! Board Initialization & Configuration
//!
//! \param  None
//!
//! \return None
//
//*****************************************************************************
static void
BoardInit(void)
{
/* In case of TI-RTOS vector table is initialize by OS itself */
#ifndef USE_TIRTOS
  //
  // Set vector table base
  //
#if defined(ccs)
    MAP_IntVTableBaseSet((unsigned long)&g_pfnVectors[0]);
#endif
#if defined(ewarm)
    MAP_IntVTableBaseSet((unsigned long)&__vector_table);
#endif
#endif
  //
  // Enable Processor
  //
  MAP_IntMasterEnable();
  MAP_IntEnable(FAULT_SYSTICK);

  PRCMCC3200MCUInit();
}

//****************************************************************************
//                            MAIN FUNCTION
//****************************************************************************
void main()
{
  long retVal = -1;
  //
  // Board Initialization
  //
  BoardInit();

  //
  // Initialize the uDMA
  //
  UDMAInit();

  //
  // Configure the pinmux settings for the peripherals exercised
  //
  PinMuxConfig();

  //
  // Configuring UART
  //
  InitTerm();

  //
  // Display banner
  //
  DisplayBanner(APPLICATION_NAME);
  InitializeAppVariables();

  //
  // Following function configure the device to default state by cleaning
  // the persistent settings stored in NVMEM (viz. connection profiles &
  // policies, power policy etc)
  //
  // Applications may choose to skip this step if the developer is sure
  // that the device is in its default state at start of applicaton
  //
  // Note that all profiles and persistent settings that were done on the
  // device will be lost
  //
  retVal = ConfigureSimpleLinkToDefaultState();

  if(retVal < 0)
  {
      if (DEVICE_NOT_IN_STATION_MODE == retVal)
          UART_PRINT("Failed to configure the device in its default state \n\r");

      LOOP_FOREVER(__LINE__);
  }

  UART_PRINT("Device is configured in default state \n\r");

  //
  // Asumption is that the device is configured in station mode already
  // and it is in its default state
  //
  retVal = sl_Start(0, 0, 0);
  if (retVal < 0)
  {
      UART_PRINT("Failed to start the device \n\r");
      LOOP_FOREVER(__LINE__);
  }

  UART_PRINT("Device started as STATION \n\r");


  UART_PRINT("Connecting to AP: %s ...\r\n",SSID_NAME);

  // Connecting to WLAN AP - Set with static parameters defined at the top
  // After this call we will be connected and have IP address
  WlanConnect();

  UART_PRINT("Connected to AP: %s \n\r",SSID_NAME);

  UART_PRINT("Device IP: %d.%d.%d.%d\n\r\n\r",
              SL_IPV4_BYTE(g_ulIpAddr,3),
              SL_IPV4_BYTE(g_ulIpAddr,2),
              SL_IPV4_BYTE(g_ulIpAddr,1),
              SL_IPV4_BYTE(g_ulIpAddr,0));

#ifdef USER_INPUT_ENABLE
    UserInput();
#else
    BsdTcpClient(PORT_NUM);
    BsdTcpServer(PORT_NUM);
#endif
  //
  // power of the Network processor
  //
  sl_Stop(SL_STOP_TIMEOUT);

  while (1)
  {
    _SlNonOsMainLoopTask();
  }
}

//*****************************************************************************
//
// Close the Doxygen group.
//! @}
//
//*****************************************************************************
